org/How-to-be-a-data-scientist-impostor.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">How to be a data scientist impostor? <code>[%]</code> <code>[/]</code></a></li>
</ul>
</div>
</div>


# How to be a data scientist impostor? <code>[%]</code> <code>[/]</code><a id="sec-1" name="sec-1"></a>

## TODO Introduction <code>[0%]</code> <code>[0/6]</code><a id="sec-1-1" name="sec-1-1"></a>

### TODO Mission statement<a id="sec-1-1-1" name="sec-1-1-1"></a>

-   The purpose of this book is to give an overview and examples of different philosophical, mathematical, and software programming techniques that would allow the reader to practice Data Science.

### TODO Exposition plan<a id="sec-1-1-2" name="sec-1-1-2"></a>

1.  We start with Data Science market diagnosis and general strategies for problem solving.
2.  Then we proceed with didactic chapters for:
    -   doing data analysis, and
    -   explanations fundamental Machine Learning (ML) algorithms.
3.  The we give practical know-how for tackling certain ML problems variations of which often occur.
4.  Finally, we show some "shock and awe" projects.

### TODO Who is the intended reader?<a id="sec-1-1-3" name="sec-1-1-3"></a>

-   This book is for the smart and audacious. (Definitely not for dummies&#x2026;)
-   The reader is expected to have least one fairly well developed relevant skill. 
    -   Like the following.
        -   Programming ability.
        -   Mathematical maturity and reasoning ability.
        -   Mathematical modeling abilities.
            -   Ability to express processes in equations and formulas.
        -   Systems operations knowledge.
        -   Strong Physics or Physical sciences engineering background.
            -   Like Mechanical Engineering, Electrical Engineering, Chemical Engineering &#x2026;
            -   Software Engineering does not count here.
-   We assume the reader is inquisitive and willing to jump into the water without knowing how to swim.

### TODO Personal Data Scientist path<a id="sec-1-1-4" name="sec-1-1-4"></a>

### TODO Personal biases<a id="sec-1-1-5" name="sec-1-1-5"></a>

### TODO The Game Theory perspective<a id="sec-1-1-6" name="sec-1-1-6"></a>

## TODO Part 1 &#x2013; General directions and orientation <code>[%]</code> <code>[/]</code><a id="sec-1-2" name="sec-1-2"></a>

### TODO Why do you want to be a data scientist ?<a id="sec-1-2-1" name="sec-1-2-1"></a>

### TODO Market perspective / view<a id="sec-1-2-2" name="sec-1-2-2"></a>

### TODO Keeping records<a id="sec-1-2-3" name="sec-1-2-3"></a>

### TODO Learning Machine Learning<a id="sec-1-2-4" name="sec-1-2-4"></a>

### TODO Machine Learning vs Statistics<a id="sec-1-2-5" name="sec-1-2-5"></a>

### TODO The personas to consider<a id="sec-1-2-6" name="sec-1-2-6"></a>

-   [ ] Simple Nuclear Physicist (SNP).
-   [ ] Common Operations Research Analyst (CORA).
-   [ ] Standard Machine Learning Engineer (SMLE).
-   [ ] Statistician pretending to be a Data Scientist.

## TODO Part 2 &#x2013; Solution strategies <code>[0%]</code> <code>[0/5]</code><a id="sec-1-3" name="sec-1-3"></a>

### TODO Formulating the problem<a id="sec-1-3-1" name="sec-1-3-1"></a>

### TODO For open problems<a id="sec-1-3-2" name="sec-1-3-2"></a>

### TODO For well defined problems<a id="sec-1-3-3" name="sec-1-3-3"></a>

### TODO On winning arguments<a id="sec-1-3-4" name="sec-1-3-4"></a>

### TODO Morphological Analysis<a id="sec-1-3-5" name="sec-1-3-5"></a>

## TODO Part 3 &#x2013; Data Analysis techniques <code>[%]</code> <code>[/]</code><a id="sec-1-4" name="sec-1-4"></a>

### TODO What is the right impression?<a id="sec-1-4-1" name="sec-1-4-1"></a>

### TODO Data summarization<a id="sec-1-4-2" name="sec-1-4-2"></a>

### TODO Contingency matrices<a id="sec-1-4-3" name="sec-1-4-3"></a>

### TODO Mosaic plots<a id="sec-1-4-4" name="sec-1-4-4"></a>

### TODO Data transformations<a id="sec-1-4-5" name="sec-1-4-5"></a>

-   [ ] Star schema, long form.
-   [ ] Wide form.
-   [ ] SQL.
-   [ ] Data packages.

### TODO Pareto Principle adherence<a id="sec-1-4-6" name="sec-1-4-6"></a>

## TODO Part 4 &#x2013; Machine Learning minimal fundamentals <code>[%]</code> <code>[/]</code><a id="sec-1-5" name="sec-1-5"></a>

### TODO What is the right impression?<a id="sec-1-5-1" name="sec-1-5-1"></a>

### TODO Association rules mining<a id="sec-1-5-2" name="sec-1-5-2"></a>

### TODO What methods to apply to what forms of data?<a id="sec-1-5-3" name="sec-1-5-3"></a>

### TODO Linear vector space representation<a id="sec-1-5-4" name="sec-1-5-4"></a>

-   [ ] Similarity.

### TODO Clustering<a id="sec-1-5-5" name="sec-1-5-5"></a>

-   [ ] K-means.
-   [ ] Bi-sectional.

### TODO Quantile Regression<a id="sec-1-5-6" name="sec-1-5-6"></a>

### TODO Dimension reduction<a id="sec-1-5-7" name="sec-1-5-7"></a>

-   [ ] SVD
-   [ ] NNMF
-   [ ] ICA

## TODO Part 5 &#x2013; Practical know-how <code>[%]</code> <code>[/]</code><a id="sec-1-6" name="sec-1-6"></a>

### TODO Importance of variables<a id="sec-1-6-1" name="sec-1-6-1"></a>

### TODO Recommenders based on Nearest Neighbors<a id="sec-1-6-2" name="sec-1-6-2"></a>

### TODO Text mining<a id="sec-1-6-3" name="sec-1-6-3"></a>

-   [ ] Using LSI and LSA.
-   [ ] Topic extraction.

### TODO Classification<a id="sec-1-6-4" name="sec-1-6-4"></a>

-   General workflow.
-   ROC.

## TODO Code of projects <code>[%]</code> <code>[/]</code><a id="sec-1-7" name="sec-1-7"></a>

### TODO Repositories<a id="sec-1-7-1" name="sec-1-7-1"></a>

### TODO Mathematica / WL Code<a id="sec-1-7-2" name="sec-1-7-2"></a>

### TODO R code<a id="sec-1-7-3" name="sec-1-7-3"></a>

### TODO Mathematica vs R projects<a id="sec-1-7-4" name="sec-1-7-4"></a>
